triqadafi/TQDFCore_STM32_ArduinoCore/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

# menu.pnum=Board part number

# menu.xserial=U(S)ART support
# menu.usb=USB support (if available)
# menu.xusb=USB speed (if available)
# menu.virtio=Virtual serial support

menu.opt=Optimize
# menu.dbg=Debug symbols and core logs
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

################################################################################
# TRQDF mark 5
GenF1.name=TRQDF mark 5

GenF1.build.core=arduino
GenF1.build.board=GenF1
GenF1.build.mcu=cortex-m3
GenF1.build.series=STM32F1xx
GenF1.build.cmsis_lib_gcc=arm_cortexM3l_math
GenF1.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}

GenF1.upload.maximum_size=131072
GenF1.upload.maximum_data_size=20480
GenF1.build.board=BLUEPILL_F103CB
GenF1.build.product_line=STM32F103xB
GenF1.build.variant_h=variant_PILL_F103Cx.h
GenF1.build.variant=STM32F1xx/F103C8T_F103CB(T-U)

# Upload menu (HID Bootloader 2.2)

GenF1.menu.upload_method.hidMethod=TRQDFCore Bootloader
GenF1.menu.upload_method.hidMethod.upload.protocol=hid22
GenF1.menu.upload_method.hidMethod.upload.tool=hid_upload
GenF1.menu.upload_method.hidMethod.build.flash_offset=0x800
GenF1.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}



################################################################################
# Serialx activation (Enabled (generic 'Serial'))

# USB connectivity (CDC (generic 'Serial' supersede U(S)ART))
GenF1.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC

# Optimizations
GenF1.menu.opt.osstd=Smallest (-Os default)
GenF1.menu.opt.oslto=Smallest (-Os) with LTO
GenF1.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF1.menu.opt.o1std=Fast (-O1)
GenF1.menu.opt.o1std.build.flags.optimize=-O1
GenF1.menu.opt.o1lto=Fast (-O1) with LTO
GenF1.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF1.menu.opt.o2std=Faster (-O2)
GenF1.menu.opt.o2std.build.flags.optimize=-O2
GenF1.menu.opt.o2lto=Faster (-O2) with LTO
GenF1.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF1.menu.opt.o3std=Fastest (-O3)
GenF1.menu.opt.o3std.build.flags.optimize=-O3
GenF1.menu.opt.o3lto=Fastest (-O3) with LTO
GenF1.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenF1.menu.opt.ogstd=Debug (-Og)
GenF1.menu.opt.ogstd.build.flags.optimize=-Og
GenF1.menu.opt.o0std=No Optimization (-O0)
GenF1.menu.opt.o0std.build.flags.optimize=-O0

# Debug information (None)

# C Runtime Library
GenF1.menu.rtlib.nano=Newlib Nano (default)
GenF1.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenF1.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenF1.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenF1.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenF1.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenF1.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenF1.menu.rtlib.full=Newlib Standard
GenF1.menu.rtlib.full.build.flags.ldspecs=